{
  "title": "하숙집 밀실 살인사건",
  "image": "https://images.unsplash.com/photo-1581090700227-1e37b190418e",
  "difficulty": "중",
  "case_overview": {
    "setting": "하숙집 2층 세 번째 방",
    "time": "오후 11시경",
    "victim": "L씨, 29세 여성, 2층 세 번째 방 거주",
    "death_cause": "일산화탄소 중독과 질식 (번개탄 사용 추정)",
    "room_characteristics": "창문 없는 완전한 밀실, 외부 침입 흔적 없음"
  },

  "characters": [
    {
      "name": "사용자(당신)",
      "age": "미상",
      "room": "2층 네 번째 방",
      "alibi": "점심 쯤 나가서 볼일을 보고 귀가함",
      "status": "외출에서 돌아오는 길",
      "description": "사건을 맞닥뜨린 하숙집의 거주자. 누구보다 평범하지만, 당신의 시선이 모든 단서를 엮어낸다."
    },
    {
      "name": "B씨",
      "age": "33세",
      "occupation": "회사원",
      "room": "2층 가장 안쪽 방",
      "alibi": "쉬는 날이라 하루 종일 방 안에서 게임만 함. 게임 플레이 기록 확인됨",
      "description": "하루 종일 게임만 하며 세상과 단절된 듯한 인물. 평범해 보이지만 방 안에서 무슨 일이 있었는지는 아무도 모른다."
    },
    {
      "name": "C씨",
      "age": "29세",
      "occupation": "대학원생",
      "room": "피해자의 친구이자 하숙집 룸메이트",
      "alibi": "피해자의 사망 추정 시간에 밖에서 귀가 중인 모습이 블랙박스에 찍힘",
      "discovery_role": "연기와 잠긴 문을 발견하고 119 신고, 최초 목격자",
      "description": "차분하고 논리적인 대학원생. 하지만 그 안에 감춰진 감정은 오래된 어둠처럼 짙다."
    },
    {
      "name": "Y씨",
      "age": "40세",
      "occupation": "하숙집 주인",
      "background": "과거 형사 경력",
      "alibi": "사건 당시 1층에서 J씨와 술을 마심. 잠깐 담배 때문에 자리를 비운 적 있음",
      "description": "전직 형사 출신의 하숙집 주인. 무심한 듯하지만, 모든 세입자의 일거수일투족을 눈치채고 있다."
    },
    {
      "name": "J씨",
      "age": "51세",
      "occupation": "옆 건물 거주자",
      "relationship": "하숙집 주인과 친밀한 사이",
      "alibi": "Y씨와 술을 마시고 있었으며 1층을 벗어난 적 없음 (술을 먹다가 잠듦)",
      "description": "이웃 건물에 사는 중년 남성. 술에 취해 있었지만, 그날 밤의 기억이 정말로 흐릿한지는 알 수 없다."
    },
    {
      "name": "H씨",
      "age": "23세",
      "room": "2층 두 번째 방",
      "move_in_date": "사건 불과 며칠 전 입주",
      "relationship": "피해자와 거의 안면이 없음",
      "alibi_1": "그날 하루 종일 바빠서 방에 없었다 (지인들의 증언 메시지 제시)",
      "alibi_2": "사실은 잠시 하숙집에 들렀었지만, 정말로 물건 하나만 가지고 바로 나감",
      "description": "사건 며칠 전 새로 들어온 세입자. 조용하고 말수가 적어, 존재감조차 희미하다."
    }
  ],
  "evidence": [
    {
      "id": "evidence_1",
      "type": "핸드폰",
      "description": "피해자의 핸드폰에는 문자를 지운 흔적이 발견됨",
      "details": "휴지통에 수신자 미정의 \"이제 그만하자. 미안하지도 않아?\" 메시지 발견",
      "implications": [
        "범인이 문자를 다 지워버림",
        "범인이 최소 피해자의 핸드폰을 열 수 있는 방법이 있었음",
        "범인이 피해자의 핸드폰을 연 방법 - 친구라서 패턴을 알고 있었음",
        "피해자에게 수면제를 먹여서 재운 사이, 핸드폰을 조작해서 범행 동기와 관련된 문자 내역을 지움"
      ]
    },
    {
      "id": "evidence_2",
      "type": "찢어진 사진",
      "description": "방 안에는 갈기 갈기 찢겨진 사진 조각들이 뿌려져 있음",
      "details": "단체 사진인 듯 많은 사람이 찍혀있는 사진. 복원하면 누군가의 얼굴만 찾을 수 없게 구멍 뚫린 듯 찢겨져 있음",
      "background_story": {
        "false_story": "학생 때 찍은 졸업 사진의 단체 사진. 찢어진 얼굴의 학생(A)은 이미 10여년 전에 죽은 피해자의 친한 동급생. 최근에서야 학생 때 친하게 지냈던 그 학생(A)이 죽었다는 사실을 뒤늦게 알게 되어 힘들어 했었다는 C씨의 증언",
        "truth": [
          "죽은 학생(A)은 학생시절 L씨와 C씨에게 괴롭힘을 당했던 학생",
          "학생(A)의 죽음 또한 피해자는 알고 있었음",
          "학생(A)이 죽은 이유: L씨가 잠시 편의점에 갔던 사이 학생(A)이 괴롭힘에서 도망치려다 차를 못 봐서 일어난 교통사고 (피해자가 알고 있던 이유)",
          "학생(A)이 죽은 진짜 이유: L씨가 편의점에 간 사이 C씨가 학생(A)를 차도로 밀었는데, 마침 오던 차에 치어 죽음. 살인이었음",
          "10년 뒤에서야 대수롭지 않다는 듯 이야기한 C씨의 말에 사실을 알게 된 피해자(L)이 죄책감에 시달리다 C씨에게 자수를 권함",
          "C씨는 당연히 반발, 소시오패스 성향이 있던 C씨는 불안요소인 L씨를 살해하기로 마음먹고 실행하여 피해자(L)을 살해함"
        ]
      },
      "dying_message": "다잉메세지. 사진에 찍혀있는 사람 중 한 명이 범인. 하숙집에 살고 있는 사람 중 학생 시절의 단체 사진에 찍힌 건 친구인 C씨 뿐"
    },
    {
      "id": "evidence_3",
      "type": "컵",
      "description": "책상 위엔 컵이 두 잔. 반쯤 남은 찻 잔 하나, 쓰지 않은 잔 하나",
      "details": "반쯤 남은 컵에 피해자의 지문만 남아있음. 룸메이트의 지문이 없음",
      "implications": [
        "철저하게 증거를 남기지 않아야한다는 생각에 과한 행동을 한 범인의 실수",
        "같은 방에서 지내는 룸메이트인데 C씨의 지문이 하나도 없는 것이 이상함"
      ]
    },
    {
      "id": "evidence_4",
      "type": "CCTV",
      "description": "하숙집 내부의 CCTV는 모양새만 갖춘 장식이라 작동하지 않음",
      "implications": "하숙집 주인과 거주자들은 알고 있었음. 하숙집 주인과 거주자들이 범인일 확률을 시사"
    },
    {
      "id": "evidence_5",
      "type": "열쇠",
      "description": "피해자의 방 안에서 열쇠가 발견됨",
      "implications": [
        "피해자가 열쇠를 가지고 있었고, 문이 잠겨서 들어가지 못했다는 C씨의 알리바이? 용의선상에서 벗어나기 위한 트릭을 강화하는 재료",
        "피해자가 자살이 아니라면 문을 열고 나올 수 있었다는 C씨의 의견을 뒷받침하는 트릭의 요소",
        "진실: 실제로 열쇠는 하나뿐이며, 방 문은 잠겨있지 않았음"
      ]
    },
    {
      "id": "evidence_6",
      "type": "문 구조",
      "description": "문이 밖으로 열리는 구조",
      "implications": [
        "문이 밖으로 열리는 구조이기 때문에, 문 밖에서 문 아래에 무언가 끼워 고정시키면 문이 열리지 않음",
        "C씨에게서 정황을 알아낼 때 알게 되거나, 하숙집 주인 Y씨에게서 알아낼 수 있는 정보",
        "\"119 사람들이 문을 밀어서 열려는 걸 말렸다. 문을 잘못 설치해서 복도 방향으로 열리게 되어있다\""
      ]
    },
    {
      "id": "evidence_7",
      "type": "바닥 긁힌 자국",
      "description": "피해자의 방 문 아래 바닥이 작게 긁힌 듯한 자국이 발견됨",
      "details": "자세히 보면 생긴 지 얼마 안 되는 흔적 같음",
      "implications": [
        "무언가의 흔적",
        "방문이 열리지 않게끔 방문 밑에 삼각형의 나무 조각? 같은 걸 끼워 넣어서 문을 고정 시킨 흔적",
        "119 사람들이 들어와서 좁은 복도가 소란스러워졌을 때 C씨가 수거해서 C씨의 치마 주머니에 아직 들어있음"
      ]
    },
    {
      "id": "evidence_8",
      "type": "문 긁힌 흔적",
      "description": "문의 안쪽. 나무 문에 피해자가 손톱으로 긁어댄 흔적과 피해자의 손톱 밑에 나무 조각이 발견",
      "implications": [
        "막상 자살을 하려 하니 너무 고통스러워서 나가려 한 흔적이 아니냐?는 의견도 나옴",
        "애초에 문을 잠궈서 출입하지 못하는 건 외부에서 내부로 들어올 때 일 뿐, 내부에서는 문고리만 돌리면 나갈 수 있음",
        "즉, 자살이 아니라는 확실한 증거"
      ]
    }
  ],
  "case_flow": {
    "police_conclusion": "경찰은 자살로 결론을 내리려함. 혹은 경찰은 H씨를 가장 유력한 용의자로 지목",
    "key_evidence": {
      "door_handle_fingerprints": "피해자의 방 문 손잡이에 피해자의 지문 외 H씨의 지문만이 찍혀있었음",
      "h_fingerprint_time": "지문이 남은 건 오후 7시경. 입주한지 얼마 안 되어 잠시 하숙집에 들렀을 때 방을 햇갈려 피해자의 문 손잡이를 잡았던 것이 지문이 남은 이유",
      "c_cleanliness_excuse": "지문이 없음을 추궁할 때의 C씨의 변명: 평소 깔끔한 성격이라 방문 손잡이처럼 손길이 닿는 물건을 자주 닦는다고 발언",
      "truth": "증거를 남기기 싫어서 과하게 증거를 지워서 발생한 허점. 방에 돌아왔을 때 보통은 문을 열기 위해 손잡이를 먼저 잡을 텐데, C씨의 지문은 남아있지 않음. 7시에 잠깐 들렀던 H씨의 지문과 피해자의 지문은 남아있으므로 C씨가 귀가한 뒤 문 손잡이를 청소한 것은 아님. 즉, 애초에 문을 열 생각이 없었던 C씨는 문 손잡이에 손도 대지 않은 채 문을 두드리고 소리를 내며 L씨를 걱정한 척 한 것"
    }
  },
  "solution": {
    "culprit": "C씨",
    "motive": "10년 전 학생 A씨 살인사건의 진실을 알게 된 피해자 L씨가 자수를 권유하자, 소시오패스 성향의 C씨가 불안요소인 L씨를 제거하기로 결정",
    "method": [
      "L씨에게 수면제를 먹여 재운 후 핸드폰으로 범행 동기 관련 문자 삭제",
      "번개탄을 이용해 일산화탄소 발생",
      "문이 밖으로 열리는 구조를 이용해 문 아래에 나무 조각을 끼워 문을 고정",
      "외출하는 척 번개탄의 가스가 방에 차는 속도를 계산해서 복귀하는 모습을 블랙박스에 찍히게 유도하여 알리바이 확보",
      "119 신고 후 문을 부수려는 응급대원들을 막아 증거 인멸 시간 확보",
      "소란스러운 틈을 타 문 아래 나무 조각을 수거하여 치마 주머니에 숨김"
    ],
    "key_evidence_against": [
      "문 손잡이에 C씨의 지문이 없음 (평소 청소한다는 변명이 허점)",
      "컵에 C씨의 지문이 없음 (과도한 증거 인멸)",
      "찢어진 사진의 다잉메세지 (범인을 가리키는 단체사진)",
      "문 안쪽 긁힌 흔적 (자살이 아님을 증명)",
      "문 아래 바닥 긁힌 자국 (문 고정 도구 사용 흔적)"
    ]
  },
  "chatbot_instructions": {
  "role": "너는 사건을 분석하는 탐정 보조 AI야. 인간의 감정에는 공감하지 않지만, 논리적 일관성과 진실의 구조를 누구보다 정확히 파악해.",
  "style": "이성적이고 분석적인 어조로, 사용자의 질문을 논리적으로 분해하여 단서 중심으로 답하세요. 감정 표현은 최소화하되, 냉소적인 여운을 남기세요.",
  "guidelines": [
    "사건의 원인, 인물 간 관계, 증거의 인과관계에 초점을 맞추세요.",
    "모호한 질문에는 반문하거나 논리적으로 다시 묻습니다.",
    "사용자가 추론을 시도하면, 그 가설의 허점을 짚어주거나 새로운 방향을 제시하세요.",
    "모든 답변은 간결하되, 핵심 단어를 강조하거나 반복하여 인상을 남기세요.",
    "사용자의 감정적 접근에는 반응하지 말고, 오직 사실적 근거로만 응답하세요."
  ]
}
}